/* ==========================================================
   Happy New Year AR
   light.js
   Version 2
========================================================== */

"use strict";

/* ==========================================================
   Light
========================================================== */

function playLight() {

    const light = document.querySelector("#light");

    if (!light) {

        console.error("Light Not Found");

        return;

    }

    //------------------------------------------------------
    // 初期化
    //------------------------------------------------------

    light.setAttribute("visible", true);

    light.setAttribute("position", {

        x: -0.48,

        y: -0.42,

        z: 0.03

    });

    light.object3D.scale.set(

        0.15,

        1,

        1

    );

    light.setAttribute("material", {

        opacity: 0

    });

    //------------------------------------------------------
    // 光る
    //------------------------------------------------------

    anime({

        targets: light.components.material.material,

        opacity: [

            0,

            1,

            1,

            0

        ],

        duration: 700,

        easing: "linear"

    });

    //------------------------------------------------------
    // 左下 → 右上
    //------------------------------------------------------

    anime({

        targets: light.object3D.position,

        x: 0.48,

        y: 0.42,

        duration: 700,

        easing: "easeOutQuad"

    });

    //------------------------------------------------------
    // 少し伸びる
    //------------------------------------------------------

    anime({

        targets: light.object3D.scale,

        x: [

            0.15,

            1.25,

            0.20

        ],

        duration: 700,

        easing: "easeOutQuart"

    });

    //------------------------------------------------------
    // 少し回転
    //------------------------------------------------------

    anime({

        targets: light.object3D.rotation,

        z: [

            -0.15,

            0.12,

            0

        ],

        duration: 700,

        easing: "easeInOutQuad"

    });

    //------------------------------------------------------
    // 演出終了
    //------------------------------------------------------

    setTimeout(() => {

        light.setAttribute("visible", false);

    }, 750);

}


/* ==========================================================
   Future
========================================================== */

/*

Ver3

ここへ追加予定

Bloom

Lens Flare

Spark

Glow

*/